       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTECOB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-NOME  PIC X(10).
       PROCEDURE DIVISION.
           DISPLAY "DIGITE O NOME: "
           ACCEPT WS-NOME
           DISPLAY "O NOME DIGITADO É: " WS-NOME
           STOP RUN.  